blogs/safer_bash_scripts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-14 Mon 19:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>更安全的shell</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">更安全的shell</h1>
<p>
在我启动了一个新的c++项目后，我从别的地方复制了一个Makefile过来，简单的修改后，我执行了 <code>make clean</code> ，然后我的系统就没了。罪魁祸首是 <code>rm -rf $(BUILDDIR)/*</code> ， <code>$(BUILDDIR)</code> 的定义被我误删了。后来当我写到 <code>find $TMPFSDIR -type f \( \( -size +10M -mtime +2 \) -o -mtime +7 -o -empty \) -delete</code> 时，我不淡定了，这行脚本将在公司所有服务器上执行，万一 <code>$TMPFSDIR</code> 被误改了，我估计得坐牢。
</p>

<p>
我抓紧找到之前看过的这篇文章 <a href="https://vaneyckt.io/posts/safer_bash_scripts_with_set_euxo_pipefail/">Safer bash scripts with 'set -euxo pipefail'</a> ，做笔记，反思。bash太强大了，也太宽松了。我必须给自己设置到防火墙。
</p>

<div id="outline-container-orgd416b9b" class="outline-2">
<h2 id="orgd416b9b"><span class="section-number-2">1</span> 笔记</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org86869b1" class="outline-3">
<h3 id="org86869b1"><span class="section-number-3">1.1</span> set -e</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>-e</code> 导致脚本一旦有错，立即退出。例如： <code>VER=$(cat /etc/version)</code> 如果文件不存在，脚本立即退出。如果允许文件不存在，可以使用  <code>VER=$(cat /etc/version || true)</code> 。如果失败的语句在条件语句中，不会导致退出。例如： <code>if test -f /etc/version; then VER=$(cat /etc/version); fi</code> 。
</p>
</div>
</div>

<div id="outline-container-org8004750" class="outline-3">
<h3 id="org8004750"><span class="section-number-3">1.2</span> set -o pipefail</h3>
<div class="outline-text-3" id="text-1-2">
<p>
通常bash只检查管道命令的最后一个，这会导致 <code>-e</code> 仅能检测最后一个命令的失败，例如 <code>VER=$(cat /etc/varsion | grep "VERSION")</code> 即使文件不存在也不会失败。 <code>-o pipefail</code> 把最后一个非零退出状态作为管道命令的退出状态（如果没有，则状态时0）。
</p>
</div>
</div>

<div id="outline-container-org7089d5c" class="outline-3">
<h3 id="org7089d5c"><span class="section-number-3">1.3</span> set -u</h3>
<div class="outline-text-3" id="text-1-3">
<p>
把未定义的变量，当作错误对待。例如，不小心把 <code>$BUILDDIR</code> 写成了 <code>$BULIDDIR</code> 则报错退出。 <code>${a:-b}</code> 的赋值方式不在此列。例如： <code>RESULT=${VAR:-NOTFOUND}</code> 这里 <code>VAR</code> 未定义，但是不报错。
</p>
</div>
</div>

<div id="outline-container-org9652233" class="outline-3">
<h3 id="org9652233"><span class="section-number-3">1.4</span> set -E</h3>
<div class="outline-text-3" id="text-1-4">
<p>
如果使用了<code>trap</code> ，使用 <code>-E</code> 配合 <code>-e</code> 使用，避免某些场景 <code>trap</code> 不执行。
</p>
</div>
</div>
</div>

<div id="outline-container-org5830559" class="outline-2">
<h2 id="org5830559"><span class="section-number-2">2</span> 反思</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbaaac1b" class="outline-3">
<h3 id="orgbaaac1b"><span class="section-number-3">2.1</span> 避免使用root</h3>
<div class="outline-text-3" id="text-2-1">
<p>
至少不会把重要数据删除。如果需要以root运行，可以赋予非root用户删除目标数据的权限，然后以非root用户删除，这样不会删除预期外的数据。
</p>
</div>
</div>

<div id="outline-container-orgc15880f" class="outline-3">
<h3 id="orgc15880f"><span class="section-number-3">2.2</span> 避免使用 rm -r</h3>
<div class="outline-text-3" id="text-2-2">
<p>
避免使用 <code>rm -r</code> ，如果不删除目录，破坏力也有限。
</p>
</div>
</div>

<div id="outline-container-orgc809377" class="outline-3">
<h3 id="orgc809377"><span class="section-number-3">2.3</span> 使用 set -Eeuo pipefail</h3>
<div class="outline-text-3" id="text-2-3">
<p>
在开始编写脚本的时候，就开启这些选项，不要在后面开启，除非测试非常完善。因为后面开启，极可能导致脚本无法正常工作。对已有脚本，可以在某些 <code>危险代码段</code> 开始时开启，结束时关闭， <code>set +Eeuo pipefail</code> 。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2019-10-14 Mon 19:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
